{
  "blog_id": "blog_mock_9",
  "title": "Hybrid Mobile App Development with Ionic Framework",
  "author": null,
  "content": "<h1>Hybrid Mobile App Development with Ionic Framework</h1>\n\n<h2>Cordova Framework</h2>\n\n<p><strong>PhoneGap</strong> was the first well known mobile development framework. It was developed by Nitobi. Nitobi was purchased by Adobe and the source code was donated to Apache. There PhoneGap got renamed to Apache Callback and then to <strong>Apache Cordova</strong>. Cordova enables software programmers to build applications for mobile devices using JavaScript, HTML5, and CSS3, instead of relying on platform-specific APIs like those in iOS, Windows Phone or Android. The resulting applications are hybrid, meaning they are neither truly native (because all layout rendering is done via web views instead of the platform's native UI framework) nor purely web-based (because they are not just web apps, not rendered by web browsers, but are packaged as apps for distribution and have access to native device APIs). Cordova acts as an application container and lets you write app in HTML, JS, CSS and package it in the target device’s installer format. Currently Cordova supports iOS, Android, Blackberry, Windows Phone, Palm WebOS, Bada, Symbian. <a href=\"https://vista-mindtree.cloudapp.net/coe_open/wp-content/uploads/2015/08/architecture-blog.png\"><img class=\"size-full wp-image-5281 aligncenter\" src=\"https://vista-mindtree.cloudapp.net/coe_open/wp-content/uploads/2015/08/architecture-blog.png\" alt=\"architecture-cordova\" width=\"466\" height=\"590\" /></a></p>\n\n<h2>Ionic Framework Inspired by this concept of hybrid mobile application development and AngularJS as proven framework for large-scale web application development, Drifty Co. created</h2>\n\n<p><strong>Ionic Framework</strong> in 2013. Ionic is free and open source SDK which offers library of mobile-optimized HTML, CSS and JS components for building highly interactive apps. It is built with SASS and optimized for AngularJS. It has set of custom HTML elements (created with AngularJS directives) for its own components, making these components (widgets) easy to use with single line of HTML code. It not only abstracts Apache Cordova but gives your app the beautiful look and feel similar to that of native apps. It also offers easy-to-use tools and services for developing mobile apps. <a href=\"https://vista-mindtree.cloudapp.net/coe_open/wp-content/uploads/2015/08/ionic.png\"><img class=\"size-full wp-image-5280 aligncenter\" src=\"https://vista-mindtree.cloudapp.net/coe_open/wp-content/uploads/2015/08/ionic.png\" alt=\"ionic-cordova-arch\" width=\"1062\" height=\"711\" /></a></p>\n\n<h2>Build Your App</h2>\n\n<h3>Setting up the environment</h3>\n\n<ul>\n<li>Ionic is an npm module. So in order to install Ionic, firstly npm (comes with <a href=\"https://nodejs.org/download/\" title=\"NodeJS\">NodeJS</a>) need to be installed.</li>\n<li><p>If working under proxy, set HTTP_PROXY and HTTPS_PROXY system variables to proxy address. Also configure npm for proxy by running <span style=\"font-family: 'courier new', courier;\">  npm config set proxy http://<proxy-server>:<port></span> <span style=\"font-family: 'courier new', courier;\">  npm config set https-proxy http://<proxy-server>:<port></span></p></li>\n<li><p>Install Cordova and Ionic using npm <span style=\"font-family: 'courier new', courier;\">  npm install -g cordova ionic</span></p></li>\n</ul>\n\n<h3>Start a new Ionic Project</h3>\n\n<ul>\n<li><p>Create a new Ionic app with an ready-made app template ‘tabs’ (skip the template name for a blank app) <span style=\"font-family: 'courier new', courier;\">ionic start NewIonicApp tabs</span></p></li>\n<li><p>Download npm dependencies needed by the application by running <span style=\"font-family: 'courier new', courier;\">npm install</span></p></li>\n<li><p>The project structure looks like</p></li>\n</ul>\n\n<p style=\"text-align: center;\">\n   <a href=\"https://vista-mindtree.cloudapp.net/coe_open/wp-content/uploads/2015/08/project-structure.png\"><img class=\"alignnone size-full wp-image-5284\" src=\"https://vista-mindtree.cloudapp.net/coe_open/wp-content/uploads/2015/08/project-structure.png\" alt=\"project-structure\" width=\"271\" height=\"461\" /></a>\n</p>\n\n<ul>\n<li><strong>bower.json</strong>: Used for managing your app's dependencies via the bower package management tool. By default, the Ionic Framework is the only dependency, but you can add more as needed.</li>\n<li><strong>config.xml</strong>: This is the configuration file for Cordova. It's used for Cordova plugin management and app settings.</li>\n<li><strong>gulpfile.js</strong>: This file is used for compiling SASS and other Ionic Framework specific tasks via the gulp task runner.</li>\n<li><strong>ionic.project</strong>: This is used for the configuration of the ionic CLI tool. You can learn about some of the configuration options available here.</li>\n<li><strong>package.json</strong>: All of your npm dependencies are stored in this file.</li>\n<li><strong>/hooks</strong>: This directory stores any Cordova Hooks that you may have.</li>\n<li><strong>/plugins</strong>: Any Cordova Plugins that you install will be saved in this folder.</li>\n<li><strong>/scss</strong>: Stores Ionic's SCSS file, but you can (optionally) put your own SCSS files in there too.</li>\n<li><p><strong>/www</strong>: This directory will contain your AngularJS controllers, partails, index.html, app.js and css file; This is the directory you will often be working in.</p>\n\n<ul>\n<li><strong>/www/css</strong>: your CSS files will be stored here.</li>\n<li><strong>/www/img</strong>: Your image assets will be stored here.</li>\n<li><strong>/www/js</strong>: All of your Javascript files will be placed here. app.js has the code which is run on application startup, defines the AngularJS application module, application states and views. Apart from it you can place your AngularJS controllers, services, directives here.</li>\n<li><strong>/www/lib</strong>: Any external libraries will be placed in here. To start, only Ionic shows up in this folder.</li>\n<li><strong>/www/templates</strong>: This contains html files which are nothing but the views (partials). They are referred in app.js.</li>\n<li><strong>/www/index.html</strong>: This is the starting point for our application. It will load up all of the necessary JS, HTML and CSS files. It refers all JS and CSS files.</li>\n</ul></li>\n<li><p>Run the app in your web browser by running <span style=\"font-family: 'courier new', courier;\">ionic serve</span>  </p></li>\n</ul>\n\n<h3>Build and view the app on Android device</h3>\n\n<ul>\n<li><p>Set up Android SDK</p>\n\n<ul>\n<li>Download <a href=\"http://mirror.tcpdiag.net/apache//ant/binaries/apache-ant-1.9.4-bin.zip\" title=\"Ant\">Apache Ant</a>.</li>\n<li>Download and install <a href=\"http://developer.android.com/sdk/index.html\" title=\"SDK\">Android SDK</a>. Add the full path to both the android-sdk/platform-tools/ folder and the android-sdk/tools/ folder to the end of your PATH variable.</li>\n<li>Run android to open Android SDK Manager. Configure proxy (if any) under Tools>Options. Select and install packages.</li>\n</ul></li>\n<li><p>Add Android platform to your Ionic project <span style=\"font-family: 'courier new', courier;\">ionic platform add android</span></p></li>\n<li><p>To add Crosswalk (Crosswalk bundles up Chromium to be used in place of the default Android browser in your device’s web view) to your Ionic App for improving performance of the app, run <span style=\"font-family: 'courier new', courier;\">ionic browser add crosswalk@12.41.296.5</span></p></li>\n<li><p>To run and test the app on system’s Android emulator run <span style=\"font-family: 'courier new', courier;\">ionic emulate android</span></p></li>\n<li><p>Build the project to create an APK file which can be used to install the app on Android devices <span style=\"font-family: 'courier new', courier;\">ionic build android</span></p></li>\n<li><p>Above step generates an APK file in *platforms\\android\\build\\outputs\\apk&#42;. Copy it to an Android device and install the app.</p></li>\n</ul>\n\n<p><a href=\"https://vista-mindtree.cloudapp.net/coe_open/wp-content/uploads/2015/08/ionic-android.png\"><img class=\"size-full wp-image-5286 aligncenter\" src=\"https://vista-mindtree.cloudapp.net/coe_open/wp-content/uploads/2015/08/ionic-android.png\" alt=\"ionic-android\" width=\"363\" height=\"632\" /></a></p>\n",
  "status": "PUBLISHED",
  "viewed_by": [],
  "tags": ["ionic", "cordova" ,"mobile", "hybridapp"],
  "liked_by": [],
  "comments": [],
  "dateOfPublishing": "2016-06-17T16:25:24.321Z"
}