{
  "blog_id": "blog_mock_23",
  "title": "Reaction to Reactive Programming and Manifesto",
  "author": null,
  "content": "<p><span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt; background-color: #ccffff;\"><strong><em>The blog has tried to reflect, contrast and communicate the emerging architecture pattern – Reactive Programming through Human and IT system analogies.</em></strong></span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">We have listened to the suggestion - 'don't be reactive'!!! <em>Is being reactive bad?</em> We have also learnt that 'Context is Decisive', so should we look at 'reactive' behavior in a context before concluding / accepting that it's not good.</span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\"> Let's take couple of examples:</span> \n1.  <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">What happens when we encounter a sudden threat to life? Our brain analyses the threat level and guides the body to ‘react’ appropriately by</span></p>\n\n<ul style=\"list-style-type: square;\">\n      <li>\n      </li>\n      <li>\n        <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">sending signals to different parts of the body like heart pump rate increases from one up to five gallons per minute</span>\n      </li>\n      <li>\n        <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">pupil dilate enabling us to see more clearly</span>\n      </li>\n      <li>\n        <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">fat from fatty cells and glucose from the liver metabolized to create instant energy</span>\n      </li>\n      <li>\n        <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">natural judgment system is turned down and more primitive responses take over</span>\n      </li>\n    </ul>\n\n<ol>\n<li><span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">What happens when we encounter negative feedback? Our brain identifies this situation as non-life threatening but an experiential one. It then starts collecting past experiences, perceptions, principles and values to support the body to react in a certain way. Different people would react differently to situations driven by these attributes. Our elders have always taught us ‘not to react’ in such situations.</span></li>\n</ol>\n\n<p><span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\"> All these activities are occurring instantly without us even knowing!</span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">If we reflect bit more on the above examples, we could find few common traits in response to a ‘reaction’ like they are instantaneous, driven by certain events, always act (even when</span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\"> we are fast asleep) and agnostic to scale of threat.</span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">Let’s now look at the examples from IT domain:</span> \n1.  <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\"> What happens when one of the node in the farm / cluster crashes? This is serious threat. Someone makes a choice to have redundancy and stop sending further requests to the crashed node. If one of the node goes down, the system will still respond but with reduced performance.</span>\n2.  <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">What happens when part of the deployed application e.g. one of the component goes down? This is not perceived as a threat to availability of the system as only part of it is not functioning (assuming that it’s well architected and coded :-) ). The system gracefully manages the component failure.</span></p>\n\n<p><span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">If we contrast the two i.e. Human and IT System architecture, we would observe similarity! i.e. most of the choices would need a runtime context. The choice of ‘optimal action’ needs assessment and someone at runtime will make that choice without impacting the system. This would mean the IT systems need to react to events (positive / negative), assess the impact / threat and make optimal choices. While there are frameworks and toolkits that are used to keep the system healthy, their usage is dependent on careful assessment of requirement and sound architecture definition.</span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">How about building a system that has inherent ability to sustain various threats and still manage to keep the system quality promises intact. This is the space that reactive programming and manifesto has tried to fill.</span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">Reactive manifesto states that a system must meet the promises (SLA) of:</span> \n1.  <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">Scalability,</span>\n2.  <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">Responsiveness,</span>\n3.  <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">Resilience,</span>\n4.  <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">Event-driven processing i.e. reactions / responses</span></p>\n\n<p><span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">These 4 attributes together are foundation of Reactive Manifesto and architecture blueprint. The manifesto drives the commitment to make responsiveness, scalability and resiliency of applications inherent or weaved into the engineering practices (programming pattern) instead of a technical leader’s judgment.</span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\"> You can read more about the manifesto <a title=\"ReactiveManifesto\" href=\"http://www.reactivemanifesto.org/\" target=\"_blank\">here</a>.</span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\"><strong>How to build Reactive Applications?</strong></span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\">Reactive extensions are available for foundation technologies like RxJava for Java, RxNet for .Net, RxJS for JavaScript and many more. While these frameworks give limited reactive capabilities, Play framework’s reactive programming model based on Akka and support for Java and Scala languages aligns closely with Reactive Manifesto.</span> <span style=\"font-family: 'trebuchet ms', geneva; font-size: 12pt;\"> Open Platform CoE has created a reference implementation that exploits power of Play framework and reactive programming model based on Akka. If you need more information before it becomes generally available, please get in touch with <a title=\"Contact OpenPlatform CoE\" href=\"https://vista-mindtree.cloudapp.net/coe_open/contact-us/\">OpenPlatform CoE</a></span>  </p>\n",
  "status": "PUBLISHED",
  "viewed_by": [],
  "tags": ["reactive", "architecture"],
  "liked_by": [],
  "comments": [],
  "dateOfPublishing": "2016-06-17T16:25:24.353Z"
}